Emissão/Exemplos XML/CTe/Exemplo_EnvioSOAP_CTe.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="InvoiCy">
   <soapenv:Header/>
   <soapenv:Body>
      <inv:recepcao.Execute>
         <inv:Invoicyrecepcao>
            <inv:Cabecalho>
               <inv:EmpPK>PYcEsFuKroDBojfiFEl+Ms==</inv:EmpPK>
               <inv:EmpCK>213f3b55d679e790258fd811cc86d309</inv:EmpCK>
               <inv:EmpCO></inv:EmpCO>
            </inv:Cabecalho>
            <inv:Informacoes>
               <inv:Texto></inv:Texto>
            </inv:Informacoes>
            <inv:Dados>
               <inv:DadosItem>
                  <inv:Documento>
					&lt;Envio&gt;&lt;ModeloDocumento&gt;CTe&lt;/ModeloDocumento&gt;&lt;Versao&gt;3.00&lt;/Versao&gt;&lt;ide&gt;&lt;cCT&gt;17281638&lt;/cCT&gt;&lt;cUF&gt;43&lt;/cUF&gt;&lt;natOp&gt;Frete de mercadorias&lt;/natOp&gt;&lt;CFOP&gt;5352&lt;/CFOP&gt;&lt;mod&gt;57&lt;/mod&gt;&lt;serie&gt;50&lt;/serie&gt;&lt;nCT&gt;14&lt;/nCT&gt;&lt;dhEmi&gt;2017-06-06T15:00:01&lt;/dhEmi&gt;&lt;fusoHorario&gt;-03:00&lt;/fusoHorario&gt;&lt;tpImp&gt;1&lt;/tpImp&gt;&lt;tpEmis&gt;1&lt;/tpEmis&gt;&lt;tpAmb&gt;2&lt;/tpAmb&gt;&lt;tpCTe&gt;0&lt;/tpCTe&gt;&lt;procEmi&gt;0&lt;/procEmi&gt;&lt;cMunEnv&gt;4310405&lt;/cMunEnv&gt;&lt;xMunEnv&gt;Independencia&lt;/xMunEnv&gt;&lt;UFEnv&gt;RS&lt;/UFEnv&gt;&lt;modal&gt;01&lt;/modal&gt;&lt;tpServ&gt;0&lt;/tpServ&gt;&lt;cMunIni&gt;4310405&lt;/cMunIni&gt;&lt;xMunIni&gt;Independencia&lt;/xMunIni&gt;&lt;UFIni&gt;RS&lt;/UFIni&gt;&lt;cMunFim&gt;4302204&lt;/cMunFim&gt;&lt;xMunFim&gt;Boa Vista do Burica&lt;/xMunFim&gt;&lt;UFFim&gt;RS&lt;/UFFim&gt;&lt;retira&gt;0&lt;/retira&gt;&lt;xDetRetira&gt;Retirar o pacote no local de entrega indicado&lt;/xDetRetira&gt;&lt;indIEToma&gt;9&lt;/indIEToma&gt;&lt;tomador&gt;&lt;toma&gt;4&lt;/toma&gt;&lt;CPF_toma&gt;99999999999&lt;/CPF_toma&gt;&lt;xNome_toma&gt;Ricardo&lt;/xNome_toma&gt;&lt;fone_toma&gt;5597207426&lt;/fone_toma&gt;&lt;email_toma&gt;email@gmail.com.br&lt;/email_toma&gt;&lt;enderTomador&gt;&lt;xLgr_toma&gt;Rua Senador Salgado Filho&lt;/xLgr_toma&gt;&lt;nro_toma&gt;463&lt;/nro_toma&gt;&lt;xCpl_toma&gt;Complemento nao informado&lt;/xCpl_toma&gt;&lt;xBairro_toma&gt;Centro&lt;/xBairro_toma&gt;&lt;cMun_toma&gt;4310405&lt;/cMun_toma&gt;&lt;xMun_toma&gt;Independencia&lt;/xMun_toma&gt;&lt;CEP_toma&gt;98915000&lt;/CEP_toma&gt;&lt;UF_toma&gt;RS&lt;/UF_toma&gt;&lt;cPais_toma&gt;1046&lt;/cPais_toma&gt;&lt;xPais_toma&gt;Brasil&lt;/xPais_toma&gt;&lt;/enderTomador&gt;&lt;/tomador&gt;&lt;/ide&gt;&lt;compl&gt;&lt;xCaracAd&gt;Encomenda&lt;/xCaracAd&gt;&lt;xCaracSer&gt;Transporte&lt;/xCaracSer&gt;&lt;xEmi&gt;Jose Campos&lt;/xEmi&gt;&lt;xObs&gt;Pagar em qualquer lugar&lt;/xObs&gt;&lt;fluxo&gt;&lt;xOrig&gt;Angra dos Reis&lt;/xOrig&gt;&lt;xDest&gt;Maria da Silva&lt;/xDest&gt;&lt;xRota&gt;129386&lt;/xRota&gt;&lt;passagem&gt;&lt;passItem&gt;&lt;xPass&gt;LHR&lt;/xPass&gt;&lt;/passItem&gt;&lt;passItem&gt;&lt;xPass&gt;CGH&lt;/xPass&gt;&lt;/passItem&gt;&lt;passItem&gt;&lt;xPass&gt;POA&lt;/xPass&gt;&lt;/passItem&gt;&lt;/passagem&gt;&lt;/fluxo&gt;&lt;Entrega&gt;&lt;tpPer&gt;1&lt;/tpPer&gt;&lt;dProg&gt;2014-07-03&lt;/dProg&gt;&lt;dIni&gt;2014-07-03&lt;/dIni&gt;&lt;dFim&gt;2014-07-03&lt;/dFim&gt;&lt;tpHor&gt;1&lt;/tpHor&gt;&lt;hProg&gt;10:30:22&lt;/hProg&gt;&lt;hIni&gt;10:30:22&lt;/hIni&gt;&lt;hFim&gt;10:30:22&lt;/hFim&gt;&lt;/Entrega&gt;&lt;/compl&gt;&lt;emit&gt;&lt;CNPJ_emit&gt;99999999999999&lt;/CNPJ_emit&gt;&lt;IE&gt;9999999999&lt;/IE&gt;&lt;IEST&gt;999999999&lt;/IEST&gt;&lt;xNome&gt;CT-E EMITIDO EM AMBIENTE DE HOMOLOGACAO - SEM VALOR FISCAL&lt;/xNome&gt;&lt;xFant&gt;EMPRESA 1&lt;/xFant&gt;&lt;enderEmit&gt;&lt;xLgr&gt;Endereco&lt;/xLgr&gt;&lt;nro&gt;1234&lt;/nro&gt;&lt;xCpl&gt;Complemento&lt;/xCpl&gt;&lt;xBairro&gt;Centro&lt;/xBairro&gt;&lt;cMun&gt;4310405&lt;/cMun&gt;&lt;xMun&gt;Independencia&lt;/xMun&gt;&lt;CEP&gt;98910000&lt;/CEP&gt;&lt;UF&gt;RS&lt;/UF&gt;&lt;fone&gt;35354560&lt;/fone&gt;&lt;/enderEmit&gt;&lt;/emit&gt;&lt;rem&gt;&lt;CPF_rem&gt;99999999999&lt;/CPF_rem&gt;&lt;IE_rem&gt;9999999999&lt;/IE_rem&gt;&lt;xNome_rem&gt;CT-E EMITIDO EM AMBIENTE DE HOMOLOGACAO - SEM VALOR FISCAL&lt;/xNome_rem&gt;&lt;xFant_rem&gt;Migrate Company&lt;/xFant_rem&gt;&lt;fone_rem&gt;55118822773343&lt;/fone_rem&gt;&lt;email_rem&gt;email@gmail.com.br&lt;/email_rem&gt;&lt;enderRem&gt;&lt;xLgr_rem&gt;Rua Angra dos Reis&lt;/xLgr_rem&gt;&lt;nro_rem&gt;666&lt;/nro_rem&gt;&lt;xCpl_rem/&gt;&lt;xBairro_rem&gt;Centro&lt;/xBairro_rem&gt;&lt;cMun_rem&gt;4310405&lt;/cMun_rem&gt;&lt;xMun_rem&gt;Independencia&lt;/xMun_rem&gt;&lt;CEP_rem&gt;98917666&lt;/CEP_rem&gt;&lt;UF_rem&gt;RS&lt;/UF_rem&gt;&lt;cPais_rem&gt;1046&lt;/cPais_rem&gt;&lt;xPais_rem&gt;Brasil&lt;/xPais_rem&gt;&lt;/enderRem&gt;&lt;/rem&gt;&lt;exped&gt;&lt;CNPJ_exp&gt;99999999999999&lt;/CNPJ_exp&gt;&lt;IE_exp&gt;9999999999&lt;/IE_exp&gt;&lt;xNome_exp&gt;CT-E EMITIDO EM AMBIENTE DE HOMOLOGACAO - SEM VALOR FISCAL&lt;/xNome_exp&gt;&lt;fone_exp&gt;5535358668&lt;/fone_exp&gt;&lt;email_exp&gt;email@email.com.br&lt;/email_exp&gt;&lt;enderExped&gt;&lt;xLgr_exp&gt;Rua das Palmeiras&lt;/xLgr_exp&gt;&lt;nro_exp&gt;115&lt;/nro_exp&gt;&lt;xCpl_exp&gt;Próximo ao bar do Zé&lt;/xCpl_exp&gt;&lt;xBairro_exp&gt;Centro&lt;/xBairro_exp&gt;&lt;cMun_exp&gt;4310405&lt;/cMun_exp&gt;&lt;xMun_exp&gt;Independencia&lt;/xMun_exp&gt;&lt;CEP_exp&gt;98915000&lt;/CEP_exp&gt;&lt;UF_exp&gt;RS&lt;/UF_exp&gt;&lt;cPais_exp&gt;1046&lt;/cPais_exp&gt;&lt;xPais_exp&gt;Brasil&lt;/xPais_exp&gt;&lt;/enderExped&gt;&lt;/exped&gt;&lt;receb&gt;&lt;CPF_rec&gt;99999999999&lt;/CPF_rec&gt;&lt;IE_rec&gt;9999999999&lt;/IE_rec&gt;&lt;xNome_rec&gt;CT-E EMITIDO EM AMBIENTE DE HOMOLOGACAO - SEM VALOR FISCAL&lt;/xNome_rec&gt;&lt;fone_rec&gt;5597207496&lt;/fone_rec&gt;&lt;email_rec&gt;email@gmail.com.br&lt;/email_rec&gt;&lt;enderReceb&gt;&lt;xLgr_rec&gt;Rua Senador Salgado Filho&lt;/xLgr_rec&gt;&lt;nro_rec&gt;463&lt;/nro_rec&gt;&lt;xCpl_rec/&gt;&lt;xBairro_rec&gt;Centro&lt;/xBairro_rec&gt;&lt;cMun_rec&gt;4310405&lt;/cMun_rec&gt;&lt;xMun_rec&gt;Independencia&lt;/xMun_rec&gt;&lt;CEP_rec&gt;98915000&lt;/CEP_rec&gt;&lt;UF_rec&gt;RS&lt;/UF_rec&gt;&lt;cPais_rec&gt;1046&lt;/cPais_rec&gt;&lt;xPais_rec&gt;Brasil&lt;/xPais_rec&gt;&lt;/enderReceb&gt;&lt;/receb&gt;&lt;dest&gt;&lt;CPF_dest&gt;99999999999&lt;/CPF_dest&gt;&lt;xNome_dest&gt;CT-E EMITIDO EM AMBIENTE DE HOMOLOGACAO - SEM VALOR FISCAL&lt;/xNome_dest&gt;&lt;fone_dest&gt;5599733466&lt;/fone_dest&gt;&lt;email_dest&gt;email@gmail.com.br&lt;/email_dest&gt;&lt;enderDest&gt;&lt;xLgr_dest&gt;Rua Travessa&lt;/xLgr_dest&gt;&lt;nro_dest&gt;280&lt;/nro_dest&gt;&lt;xCpl_dest&gt;Próximo ao hospital&lt;/xCpl_dest&gt;&lt;xBairro_dest&gt;Rita&lt;/xBairro_dest&gt;&lt;cMun_dest&gt;4310405&lt;/cMun_dest&gt;&lt;xMun_dest&gt;Independencia&lt;/xMun_dest&gt;&lt;CEP_dest&gt;98910000&lt;/CEP_dest&gt;&lt;UF_dest&gt;RS&lt;/UF_dest&gt;&lt;cPais_dest&gt;1046&lt;/cPais_dest&gt;&lt;xPais_dest&gt;Brasil&lt;/xPais_dest&gt;&lt;/enderDest&gt;&lt;/dest&gt;&lt;vPrest&gt;&lt;vTPrest&gt;32321.23&lt;/vTPrest&gt;&lt;vRec&gt;12312.23&lt;/vRec&gt;&lt;Comp&gt;&lt;compItem&gt;&lt;xNome_comp&gt;Componente 1&lt;/xNome_comp&gt;&lt;vComp&gt;812.44&lt;/vComp&gt;&lt;/compItem&gt;&lt;compItem&gt;&lt;xNome_comp&gt;Componente 2&lt;/xNome_comp&gt;&lt;vComp&gt;1612.44&lt;/vComp&gt;&lt;/compItem&gt;&lt;/Comp&gt;&lt;/vPrest&gt;&lt;imp&gt;&lt;vTotImp&gt;59.90&lt;/vTotImp&gt;&lt;infAdFisco&gt;Informacoes de interesse do fisco estarão escritas aqui&lt;/infAdFisco&gt;&lt;ICMS&gt;&lt;CST&gt;00&lt;/CST&gt;&lt;vBC&gt;12&lt;/vBC&gt;&lt;pICMS&gt;13&lt;/pICMS&gt;&lt;vICMS&gt;1.56&lt;/vICMS&gt;&lt;indSN&gt;1&lt;/indSN&gt;&lt;/ICMS&gt;&lt;/imp&gt;&lt;infCTeNorm&gt;&lt;infCarga&gt;&lt;vMerc&gt;599.65&lt;/vMerc&gt;&lt;proPred&gt;Pepitas de ouro&lt;/proPred&gt;&lt;xOutCat&gt;Que valem mais do que dinheiro&lt;/xOutCat&gt;&lt;vCargaAverb&gt;200.00&lt;/vCargaAverb&gt;&lt;infQ&gt;&lt;infQItem&gt;&lt;cUnid&gt;01&lt;/cUnid&gt;&lt;tpMed&gt;PESO BASE DE CÁLCULO&lt;/tpMed&gt;&lt;qCarga&gt;899&lt;/qCarga&gt;&lt;/infQItem&gt;&lt;infQItem&gt;&lt;cUnid&gt;01&lt;/cUnid&gt;&lt;tpMed&gt;PESO BRUTO&lt;/tpMed&gt;&lt;qCarga&gt;500&lt;/qCarga&gt;&lt;/infQItem&gt;&lt;infQItem&gt;&lt;cUnid&gt;00&lt;/cUnid&gt;&lt;tpMed&gt;M3&lt;/tpMed&gt;&lt;qCarga&gt;600&lt;/qCarga&gt;&lt;/infQItem&gt;&lt;infQItem&gt;&lt;cUnid&gt;03&lt;/cUnid&gt;&lt;tpMed&gt;UNIDADE&lt;/tpMed&gt;&lt;qCarga&gt;520&lt;/qCarga&gt;&lt;/infQItem&gt;&lt;infQItem&gt;&lt;cUnid&gt;05&lt;/cUnid&gt;&lt;tpMed&gt;PESO AFERIDO&lt;/tpMed&gt;&lt;qCarga&gt;332&lt;/qCarga&gt;&lt;/infQItem&gt;&lt;/infQ&gt;&lt;/infCarga&gt;&lt;infDoc&gt;&lt;infDocItem&gt;&lt;tipoDocumento&gt;1&lt;/tipoDocumento&gt;&lt;mod_nf&gt;01&lt;/mod_nf&gt;&lt;serie_nf&gt;445&lt;/serie_nf&gt;&lt;nDoc_nf&gt;887&lt;/nDoc_nf&gt;&lt;dEmi_nf&gt;2014-09-03&lt;/dEmi_nf&gt;&lt;vBC_nf&gt;99.01&lt;/vBC_nf&gt;&lt;vICMS_nf&gt;99.02&lt;/vICMS_nf&gt;&lt;vBCST_nf&gt;99.03&lt;/vBCST_nf&gt;&lt;vST_nf&gt;99.04&lt;/vST_nf&gt;&lt;vProd_nf&gt;99.05&lt;/vProd_nf&gt;&lt;vNF_nf&gt;99.06&lt;/vNF_nf&gt;&lt;CFOP_nf&gt;5352&lt;/CFOP_nf&gt;&lt;UnidadesTransp&gt;&lt;UnidadesTranspItem&gt;&lt;tipoUnidTransporte&gt;5&lt;/tipoUnidTransporte&gt;&lt;idUnidTransporte&gt;BCIASUDX988&lt;/idUnidTransporte&gt;&lt;qtdRateada&gt;999&lt;/qtdRateada&gt;&lt;LacresUnidTransp&gt;&lt;LacresUnidTranspItem&gt;&lt;nLacreUnidTransp&gt;999&lt;/nLacreUnidTransp&gt;&lt;/LacresUnidTranspItem&gt;&lt;/LacresUnidTransp&gt;&lt;UnidadesCargaTran&gt;&lt;UnidadesCargaTranItem&gt;&lt;tipoUnidCargaTran&gt;2&lt;/tipoUnidCargaTran&gt;&lt;idUnidCargaTran&gt;22&lt;/idUnidCargaTran&gt;&lt;qtdRateadaCargaTran&gt;10&lt;/qtdRateadaCargaTran&gt;&lt;LacresUnidCargaTran&gt;&lt;LacresUnidCargaTranItem&gt;&lt;nLacreUnidCargaTran&gt;100&lt;/nLacreUnidCargaTran&gt;&lt;/LacresUnidCargaTranItem&gt;&lt;/LacresUnidCargaTran&gt;&lt;/UnidadesCargaTranItem&gt;&lt;/UnidadesCargaTran&gt;&lt;/UnidadesTranspItem&gt;&lt;/UnidadesTransp&gt;&lt;/infDocItem&gt;&lt;/infDoc&gt;&lt;infModal&gt;&lt;versaoModal&gt;3.00&lt;/versaoModal&gt;&lt;rodo&gt;&lt;RNTRC&gt;89173646&lt;/RNTRC&gt;&lt;occ&gt;&lt;occItem&gt;&lt;serie_occ&gt;123&lt;/serie_occ&gt;&lt;nOcc&gt;123456&lt;/nOcc&gt;&lt;dEmi_occ&gt;2017-05-19&lt;/dEmi_occ&gt;&lt;emiOcc&gt;&lt;CNPJ_occ&gt;99999999999999&lt;/CNPJ_occ&gt;&lt;cInt_occ&gt;123&lt;/cInt_occ&gt;&lt;IE_occ&gt;9999999999&lt;/IE_occ&gt;&lt;UF_occ&gt;RS&lt;/UF_occ&gt;&lt;/emiOcc&gt;&lt;/occItem&gt;&lt;/occ&gt;&lt;/rodo&gt;&lt;/infModal&gt;&lt;/infCTeNorm&gt;&lt;/Envio&gt;
				  </inv:Documento>
                  <inv:Parametros></inv:Parametros>
               </inv:DadosItem>
            </inv:Dados>
         </inv:Invoicyrecepcao>
      </inv:recepcao.Execute>
   </soapenv:Body>
</soapenv:Envelope>